Go

His guitar is tuned pretty high on this song (or the tape is running fast)   to play along you ll either need to tune higher or capo at the first fret.

I also think he s missing the first string on his guitar. Either that or it s just being blocked out.  The chords below sound pretty much like the recording, but regular 6-string chords work just fine too.

Whenever he goes to the C chord, he usually plays am Am7 chord for one beat first.  My guess is that it just took him a second to get the last finger down on the C chord.  Whether or not it s intentional, that little moment of Am7 makes the song for me... so I ve included it.

Verse chords
G      3-2-0-0-3-X
Am7   0-0-2-0-1-X
C     0-3-2-0-1-X
D     X-0-0-3-2-X
Em    0-2-2-0-0-X

Chorus chords
G       3-2-0-0-0-X
G/F#   2-X-0-0-0-X
open   0-0-0-0-0-X
Em, D, Am7, and C same as before

Verse progression
1   2   3   4   | 1   2   3   4   | (repeat)
G                 Am7 C

1   2   3    4   | 1   2   3   4   |
D       Am7 C     Em      G

So you think you've found the one
And she knows just how you feel
And you say that she's for real and she's fun
Well, that's all well and good
That's just the way it should be
To understand and be understood is to be free
So I think that you should go
Go on ahead
Take her in your arms and be wed

Chorus progression
1   2   3   4   | 1   2   3   4   | 1   2   3   4   | (repeat)
G       G/F#     open    Em        D

1     2   3   4   | back to verse (G chord)
Am7 C

Go, go, go, go 
You restless soul, you're going to find it
Go, go, go, go, 
You restless soul, you're going to find it

Life's a bowl of cherries
You can have as many as you can carry
And someone once said that life is like a cow
But I don't know how that applies
But anyhow here we are all on this planet
Taking everything for granted
But I think you've caught on to something
Don't let go

Go, go, go, go 
You restless soul, you're going to find it
Go, go, go, go 
You restless soul, you're going to find it
Oh, yes you did, you found it
Oh, yes you did, you found it
Oh, yes you did, you found it